<?php

namespace Larabookir\Gateway\AsanPardakht;

use Larabookir\Gateway\Exceptions\BankException;

class AsanPardakhtException extends BankException {

    /**
     * All different kinds of errors.
     *
     * @var array
     */
    public $errors = [
        - 993 => "خطای فراخوانی متد درخواست تراکنش.",
        - 994 => "شماره ارجاع تراکنش مطابقت ندارد.",
        - 995 => "مبلغ پرداخت شده با مبلغ تراکنش برابر نیست.",
        - 996 => "خطای فراخوانی متد تسويه",
        - 997 => "خطای فراخوانی متد وریفای",
        - 998 => "تراکنش ناموفق",
        - 999 => "خطا در فراخوانی وب‌سرويس",

        // operation request related errors...
        301   => "پیکربندی پذیرنده اینترنتی نامعتبر است.",
        302   => "کلیدهای رمزنگاری نامعتبر هستند.",
        303   => "رمزنگاری نامعتبر است.",
        304   => "تعداد عناصر درخواست نامعتبر است.",
        305   => "نام کاربری یا رمز عبور پذیرنده نامعتبر است.",
        306   => "با آسان پرداخت تماس بگیرید.",
        307   => "سرور پذیرنده نامعتبر است.",
        308   => "شناسه فاکتور می‌بایست صرفاً عدد باشد.",
        309   => "مبلغ فاکتور نادرست است.",
        310   => "طول فیلد تاریخ و زمان نامعتبر است.",
        311   => "فرمت تاریخ و زمان ارسالی پذیرنده نامعتبر است.",
        312   => "نوع سرویس نامعتبر است.",
        313   => "شناسه پرداخت کننده نامعتبر است.",
        315   => "فرمت توصیف شیوه تسهیم شبا نامعتبر است.",
        316   => "شیوه تقسیم وجوه با مبالغ کل تراکنش همخوانی ندارد.",
        317   => "شبا متعلق به پذیرنده نیست.",
        318   => "هیچ شبایی برای پذیرنده موجود نیست.",
        319   => "خطای داخلی. لطفاً درخواست را دوباره ارسال کنید.",
        320   => "شبای تکراری در رشته درخواست ارسال شده است.",
        - 100 => "تاریخ ارسالی محلی پذیرنده نامعتبر است.",
        - 103 => "مبلغ فاکتور برای پیکربندی فعلی پذیرنده فعال نیست.",
        - 106 => "سرویس وجود ندارد یا برای پذیرنده فعال نیست.",
        - 109 => "هیچ آدرس کال بکی برای درخواست پیکربندی نشده است.",
        - 112 => "شماره فاکتور نامعتبر یا تکراری است.",
        - 115 => "پذیرنده فعال نیست یا پیکربندی پذیرنده غیرمعتبر است.",

        // request verification related errors...
        500   => "بازبینی تراکنش با موفقیت انجام شد.",
        501   => "پردازش هنوز انجام نشده است.",
        502   => "وضعیت تراکنش نامشخص است.",
        503   => "تراکنش اصلی ناموفق بوده است.",
        504   => "قبلاً درخواست بازبینی برای این تراکنش داده شده است.",
        505   => "قبلاً درخواست تسویه برای این تراکنش ارسال شده است.",
        506   => "قبلاً درخواست بازگشت برای این تراکنش ارسال شده است.",
        507   => "تراکنش در لیست تسویه قرار دارد.",
        508   => "تراکنش در لیست بازگشت قرار دارد.",
        509   => "امکان انجام عملیات به سبب وجود مشکل داخلی وجود ندارد.",
        510   => "هویت درخواست کننده عملیات نامعتبر است.",

        // request reconciliation related errors...
        600   => "درخواست تسویه تراکنش با موفقیت ارسال شد.",
        601   => "پردازش هنوز انجام نشده است.",
        602   => "وضعیت تراکنش نامشخص است.",
        603   => "تراکنش اصلی ناموفق بوده است.",
        604   => "تراکنش بازبینی نشده است.",
        605   => "قبلاً درخواست بازگشت برای این تراکنش ارسال شده است.",
        606   => "قبلاً درخواست تسویه برای این تراکنش ارسال شده است.",
        607   => "امکان انجام عملیات به سبب وجود مشکل داخلی وجود ندارد.",
        608   => "تراکنش در لیست منتظر بازگشت‌ها وجود دارد.",
        609   => "تراکنش در لیست منتظر تسویه‌ها وجود دارد.",
        610   => "هویت درخواست کننده عملیات نامعتبر است.",

        // request reversal related errors...
        700   => "درخواست بازگشت تراکنش با موفقیت ارسال شد.",
        701   => "پردازش هنوز انجام نشده است.",
        702   => "وضعیت تراکنش نامشخص است.",
        703   => "تراکنش اصلی ناموفق بوده است.",
        704   => "امکان بازگشت یک تراکنش بازبینی شده وجود ندارد.",
        705   => "قبلاً درخواست بازگشت برای این تراکنش ارسال شده است.",
        706   => "قبلاً درخواست تسویه برای این تراکنش ارسال شده است.",
        707   => "امکان انجام عملیات به سبب وجود مشکل داخلی وجود ندارد.",
        708   => "تراکنش در لیست منتظر بازگشت‌ها وجود دارد.",
        709   => "تراکنش در لیست منتظر تسویه‌ها وجود دارد.",
        710   => "هویت درخواست کننده عملیات نامعتبر است.",

        // trx status from local invoice id related errors...
        400   => "موفق",
        401   => "حالت اولیه",
        402   => "هویت درخواست کننده نامعتبر است.",
        403   => "تراکنشی یافت نشد.",
        404   => "خطا در پردازش",

        // trx status from local invoice id related errors...
        1100  => "موفق",
        1101  => "هویت درخواست کننده نامعتبر است.",
        1102  => "خطا در پردازش",
        1103  => "تراکنشی یافت نشد.",
    ];

    /**
     * Make new class of this type.
     *
     * @param string $errorCode
     */
    public function __construct($errorCode)
    {
        $code = intval($errorCode);

        parent::__construct($this->errors[$code], $code);
    }
}
